Repository: mohsengham/miniload
Catalog: languages/miniload-*.po
Languages: fa_ir

source: MiniLoad - Performance Optimizer for WooCommerce
fa_ir: مینی‌لود - بهینه‌ساز واقعی ووکامرس

source: Supercharge your WooCommerce store with blazing-fast AJAX search, optimized queries, and intelligent caching.
fa_ir: با مشکلات سرعت و کارایی ووکامرس بجنگید!

source: Minimall Team
fa_ir: تیم مینیال

source: Dashboard
fa_ir: پیشخوان

source: Search Settings
fa_ir: تنظیمات جستجو

source: Modules
fa_ir: ماژول‌ها

source: Tools
fa_ir: ابزارها

source: Settings
fa_ir: تنظیمات

source: Security check failed. Please try again.
fa_ir: بررسی موارد امنیتی موفقیت آمیز نبود. لطفا دوباره سعی کنید.

source: Search products...
fa_ir: جستجوی محصولات...

source: Settings saved successfully!
fa_ir: تنظیمات با موفقیت ذخیر شد.

source: Clear Cache
fa_ir: پاک کردن کش

source: Tab content not found.
fa_ir: محتوایی یافت نشد

source: Save Settings
fa_ir: ذخیره تنظیمات

source: AJAX Search Settings
fa_ir: تنظیمات سرچ باکس

source: Configure the AJAX Search module - Better than FiboSearch!
fa_ir: تنظیمات سرچ باکس

source: Enable AJAX Search
fa_ir: فعال کردن سرچ باکس

source: Enable AJAX search functionality
fa_ir: فعال کردن ویژگی آجاکس

source: Minimum Characters
fa_ir: حداقل کاراکتر ورودی

source: Minimum characters before search starts
fa_ir: حداقل کاراکتر ورودی برای شروع فرایند جستجو

source: Maximum Results
fa_ir: حداکثر نتایج

source: Maximum number of results to display
fa_ir: تعداد نتایح نمایش داده شده در سرچ باکس

source: Replace Default Search
fa_ir: جایگزینی کادر جستجو

source: Replace WordPress default search forms
fa_ir: جایگزینی کادر جستجوی پیش‌فرض وردپرس

source: Enable Search Modal
fa_ir: فعال کردن سرچ باکس مدیریت

source: Enable modal search (Alt+K)
fa_ir: فعالسازی سرچ باکس مدیریت با کلیدهای Alt+K

source: Search Content
fa_ir: جستجوی متن

source: Include full product descriptions in search
fa_ir: جستجو در توضیحات کامل محصولات

source: Unchecking this will only search in product titles, SKUs, and short descriptions for better performance.
fa_ir: با فعال نکرده این گزینه و محدود کردن جستجو به عنوان، شناسه و توضیحات کوتاه محصول، کارایی و سرعت بالاتری خواهید داشت

source: Note: After changing this setting, you need to rebuild the search index.
fa_ir: توجه: بعد از تغییر این گزینه باید ایندکس جستجوی محصول را بازسازی کنید.

source: Rebuild Search Index
fa_ir: ساخت مجدد ایندکس جستجوی محصولات

source: Advanced Search Features
fa_ir: تظیمات پیشرفته جستجو

source: Media Library Search
fa_ir: جستجوی رسانه

source: Enable accelerated media library search
fa_ir: فعالسازی جستجوی بهینه رسانه

source: Indexes media titles, alt text, captions, and metadata for faster searching.
fa_ir: ایندکس کردن اطلاعات فایل‌های آپلود شده برای جستجوی سریعتر

source: Note: Initial indexing may take a few minutes for large media libraries.
fa_ir: توجه: فرایند ایندکس اولیه بسته به تعداد فایلها ممکن است چند دقیقه طول بکشد.

source: Rebuild Media Index
fa_ir: ساخت مجدد ایندکس رسانه

source: Editor Link Builder
fa_ir: لینک‌ساز ویرایشگر

source: Use FULLTEXT product search in editor link dialog
fa_ir: استفاده از سرچ بهینه در ویرایشگر ودرپرس

source: Intercepts WordPress editor link search to use our optimized FULLTEXT product index.
fa_ir: با تغییر مکانیزم سرچ و ستفاده از ایندکسهای مینی‌لود جستجوی سریعتر در ویرایشگر خواهید داشت

source: Makes product linking 5-10x faster when creating content.
fa_ir: خبری از تاخیر در نمایش لینکها و کوئریهای سنگین دیتابیس نخواهد بود!

source: Requires: Product search index to be built (from main search settings).
fa_ir: نیاز به ایندکس جستجوی محصولات داره

source: Shortcode Examples
fa_ir: نمونه‌ها

source: Complete Parameters Reference
fa_ir: لیست کامل پارامترها

source: Parameter
fa_ir: پارامتر

source: Default
fa_ir: پیش‌فرض

source: Description
fa_ir: توضیحات

source: This will rebuild the entire search index. Continue?
fa_ir: از بازسازی کامل ایندکس مطمئنید؟

source: Error rebuilding index
fa_ir: خطا در عملیات بازسازی ایندکس

source: This will rebuild the media search index. Continue?
fa_ir: از بازسازی ایندکس رسانه مطمئنید؟

source: Welcome to MiniLoad
fa_ir: به مینی‌لود خوش امدید

source: Your WooCommerce store is now supercharged with advanced search and performance optimizations.
fa_ir: از سرعت و کارایی بهتر فروشگاه ووکامرسی خود لذت ببرید!

source: Products Indexed
fa_ir: محصول ایندکس شده

source: Media Indexed
fa_ir: رسانه ایندکس شده

source: Active
fa_ir: فعال

source: Inactive
fa_ir: غیرفعال

source: Products with Reviews
fa_ir: محصولات دارای دیدگاه

source: Pre-calculated stats
fa_ir: آمار از پیش ساخته شده

source: Quick Actions
fa_ir: عملیات سریع

source: Clear All Caches
fa_ir: پاکسازی تمام کش

source: Configure Search
fa_ir: پیکربندی جستجو

source: System Status
fa_ir: وضعیت سیستم

source: Search Index Table
fa_ir: جدول ایندکس

source: Missing
fa_ir: عدم پشتیبانی

source: MySQL FULLTEXT Support
fa_ir: پشتیبانی MySQL FULLTEXT

source: Supported
fa_ir: ردیفه!

source: Requires MySQL 5.6+
fa_ir: به MySQL نسخه ۵.۶ یا بالاتر نیاز دارد

source: WooCommerce
fa_ir: ووکامرس

source: Not Active
fa_ir: فعال نیست

source: PHP Version
fa_ir: نسخه پی اچ پی

source: Upgrade recommended
fa_ir: نباز به ارتقا

source: Core Modules
fa_ir: ماژولهای اصلی

source: AJAX Search
fa_ir: سرچ باکس (آجاکس)

source: Real-time product search with instant results. Uses FULLTEXT indexing for lightning-fast performance.
fa_ir: جستجوی سریع و در لحظه با استفاده از ایندکسهای بهینه

source: Admin Quick Search
fa_ir: سرچ باکس مخصوص مدیریت

source: Quick admin search modal (Alt+K) for products, posts, orders, and customers.
fa_ir: جستجوی سریع محصولات، سفارشات و کاربران در بخش مدیریت با کلیدهای ترکیبی Alt+k

source: Media Search
fa_ir: جستجوی رسانه

source: Accelerates WordPress media library search with indexed alt text, captions, and EXIF data.
fa_ir: افزایش سرعت جستجوی رسانه با اطلاعات ایندکس شده

source: Enhances WordPress editor link search with product results using FULLTEXT index.
fa_ir: افزایش سرعت جستجوی لینک در ویرایشگر وردپرس با استفاده از ایندکسهای بهینه

source: Performance Modules
fa_ir: ماژول‌های بهینه‌سازی

source: Query Optimizer
fa_ir: بهینه‌ساز کوئری

source: Optimizes WooCommerce database queries for faster page loads.
fa_ir: بهینه‌سازی کوئری‌های ووکامرس برای افزایش سرعت لود صفحات

source: Cache Manager
fa_ir: مدیریت کش

source: Intelligent caching system for search results and product data.
fa_ir: کش هوشمند نتایج جستجو و اطلاعات محصول

source: Single Product Optimization
fa_ir: بهینه‌سازی تک محصول

source: Related Products Cache
fa_ir: کش محصولات مرتبط

source: Caches related products, upsells, and cross-sells to speed up single product pages.
fa_ir: کش کردن محصولات مرتبط برای افزایش سرعت لود صفحات محصول

source: Review Stats Cache
fa_ir: کش آمار دیدگاه محصولات

source: Pre-calculates and caches product ratings and review counts for instant display.
fa_ir: محاسبه و کش کردن امتیاز و تعداد دیدگاه محصولات برای نمایش سریعتر

source: Search Configuration
fa_ir: پیکربندی جستجو

source: Enable real-time AJAX search with instant results
fa_ir: فعال کردن جستجوی آجاکس

source: Minimum characters required to trigger search
fa_ir: حداقل کاراکتر ورودی برای شروع فرایند جستجو

source: Search Delay (ms)
fa_ir: تاخیر جستجو (میلی ثانیه)

source: Delay before search triggers after typing stops
fa_ir: زمان شروع فرایند جستجو پس از توقف تایپ

source: Results Per Page
fa_ir: تعداد نتایج

source: Number of products to show in search results
fa_ir: تعداد محصولی که سرچ باکس آجاکس نمایش میدهد

source: Search In Product Content
fa_ir: جستجو در توضیحات کامل محصول

source: Include full product descriptions in search. Uncheck for better performance.
fa_ir: بهتر است برای کارایی بهتر و نتایج دقیقتر این گزینه غیرفعال باشد

source: Search Fields
fa_ir: گزینه‌های جستجو

source: Search In
fa_ir: جستجو در

source: Product Title
fa_ir: عنوان محصول

source: SKU
fa_ir: شناسه محصول

source: Short Description
fa_ir: توضیحات کوتاه

source: Categories
fa_ir: دسته‌ها

source: Tags
fa_ir: برچسب‌ها

source: Search Box Appearance
fa_ir: ظاهر سرچ باکس

source: Show Categories Filter
fa_ir: نمایش باکس دسته‌ها

source: Display category filter dropdown in search box
fa_ir: نمایش کادر کشویی دسته‌ها در سرچ باکس

source: Show Categories in Results
fa_ir: نمایش دسته‌های مرتبط با عبارت جستجو شده

source: Display matching categories in search results dropdown
fa_ir: تعداد مشخصی از دسته‌های مرتبط با کلمات کلیدی جستجو شده را در لیست نتایج جستجو نمایش میدهد

source: Search Icon
fa_ir: آیکون جستجو

source: Show
fa_ir: نمایش دادن

source: Hide
fa_ir: مخفی کردن

source: When shown, the icon appears on the left side (automatic for RTL layout)
fa_ir: برای زبانهای راست به چپ در سمت چپ سرچ باکس نمایش داده می‌شود

source: When shown, the icon appears on the right side (automatic for LTR layout)
fa_ir: برای زبانهای چپ به راست در سمت راست سرچ باکس نمایش داده می‌شود

source: Placeholder Text
fa_ir: متن پیش‌فرض سرچ باکس

source: Show Product Price
fa_ir: نمایش قیمت

source: Display product prices in search results
fa_ir: نمایش قیمت محصولات در نتایج جستجوی سرچ باکس

source: Show Product Image
fa_ir: نمایش تصویر

source: Display product thumbnails in search results
fa_ir: نمایش تامبنیل محصولات در نتایج جستجوی سرچ باکس

source: Font Style
fa_ir: فونت

source: Inherit from Theme
fa_ir: پیروی از استایل پوسته

source: System Font Stack
fa_ir: فونت سیستم

source: Choose whether to use your theme's font or a system font stack for the search box
fa_ir: فونت پوسته با سیستم بازدید کننده؟

source: Shortcode Usage
fa_ir: کدهای کوتاه

source: Basic Usage (Always Visible)
fa_ir: استفاده نرمال (نمایش همیشگی سرچ باکس)

source: Icon Only for Headers
fa_ir: آیکون تنها (مخصوص سربرگ)

source: With Categories
fa_ir: همراه با نمایش دسته‌ها

source: Custom Placeholder
fa_ir: متن سفارشی

source: General Settings
fa_ir: تنظیمات عمومی

source: Enable MiniLoad
fa_ir: فعالسازی مینی‌لود

source: Master switch to enable/disable all MiniLoad features
fa_ir: فعالسازی و غسرفعالسازی کل ویژگیهای مینی‌لود

source: Debug Mode
fa_ir: حالت دیباگ

source: Enable debug logging for troubleshooting
fa_ir: فعالسازی حالت دیباگ برای بررسی مشکلات افزونه

source: Load Priority
fa_ir: اولویت لود

source: Plugin load priority (lower numbers load first)
fa_ir: اولویت لود افزونه نسبت به بقیه افزونه‌ها (عدد پایینتر=اولویت بالاتر)

source: Performance Settings
fa_ir: تنظیمات بهینه‌سازی

source: Cache Duration
fa_ir: زمان کش

source: Cache duration in seconds (default: 3600 = 1 hour)
fa_ir: عمر کش به ثانیه (پیشفرض: ۱ ساعت)

source: Batch Processing Size
fa_ir: تعداد آیتم پردازش

source: Number of items to process per batch during indexing
fa_ir: تعداد آیتم برای هر مرحله از فرایند ایندکس کردن

source: Memory Limit
fa_ir: محدودیت رم

source: Memory limit for indexing operations
fa_ir: میزان رم مجاز برای عملیات ایندکس کردن

source: Auto-index New Products
fa_ir: ایندکس خودکار محصولات جدید

source: Automatically index new products when they are created
fa_ir: ایندکس کردن خودکار محصولات در زمان انتشار

source: Advanced Settings
fa_ir: تنظیمات پیشرفته

source: Database Prefix
fa_ir: پیوشند دیتابیس

source: Database table prefix (read-only)
fa_ir: پیشوند دیتابیس برای جدولهای مینی‌لود

source: Uninstall Behavior
fa_ir: نحوه حذف افزونه

source: Keep data and settings
fa_ir: نگه داشتن تنظیمات و دیتا

source: Remove all data and settings
fa_ir: حذف تمام تنظیمات و دیتا

source: What to do with data when plugin is uninstalled
fa_ir: عملیات مورد نظر در زمان حذف افزونه

source: Enable REST API endpoints for search
fa_ir: فعال سازی REST API برای جستجو

source: AJAX Nonce Lifetime
fa_ir: عمر توکن امنیتی آجاکس

source: 1 day
fa_ir: ۱ روز

source: 2 days
fa_ir: ۲ روز

source: 1 week
fa_ir: ۱ هفته

source: How long AJAX nonces remain valid
fa_ir: مدت زمان عمر توکن‌های امنیتی آجاکس

source: License & Support
fa_ir: لایسنس و پشتیبانی

source: License
fa_ir: لایسنس

source: MiniLoad is released under the GPLv2 or later license.
fa_ir: مینی‌لود تحت لایسنس GPLv2 یا بالاتر منتشر شده و به فلسفه وردپرس احترام میگذارد...

source: This is free software; you can redistribute it and/or modify it under the terms of the GNU General Public License.
fa_ir: مینی‌لود یک نرم‌افزار آزاد است. شما مجاز به انجام هر کاری بر اساس GNU General Public License هستید!

source: Support
fa_ir: پشتیبانی

source: Need help? Visit our support channels:
fa_ir: گزارش خطا و پشتیبانی

source: GitHub Repository
fa_ir: گیتهاب

source: WordPress.org Forums
fa_ir: انجمن وردپرس

source: Documentation
fa_ir: مستندات

source: Credits
fa_ir: کردیت

source: Developed by MiniMall Team
fa_ir: توسعه داده شده توسط تیم مینیمال و Claude code

source: Special thanks to all contributors and testers.
fa_ir: با تشکر از تمام دوستانی که به هر نحو به تولد این افزونه کمک کردند...

source: View Contributors
fa_ir: نمایش توسعه دهندگان

source: Danger Zone
fa_ir: مراقب باشید!

source: These actions are irreversible. Please proceed with caution.
fa_ir: عملیات غیرقابل برگشت!

source: Are you sure? This will reset all settings to defaults.
fa_ir: از بازنشانی تنظیمات پیش‌فرض اطمینان دارید؟

source: Reset All Settings
fa_ir: بازنشانی تمام تنظیمات

source: Search index rebuilt successfully. %d products indexed.
fa_ir: ایندکس جستجو با موفقیت بازسازی شد. تعداد آیتمهای ایندکس شده: %d

source: Media index rebuilt successfully. %d items indexed.
fa_ir: ایندکس رسانه با موفقیت بازسازی شد. تعداد آیتمهای ایندکس شده: %d

source: All caches cleared successfully.
fa_ir: تمام کش با موفقیت پاک شد

source: Database tables optimized successfully.
fa_ir: جدولهای دیتابیس با موفقیت بهینه‌سازی شدند

source: Index Management
fa_ir: مدیریت ایندکس

source: Product Search Index
fa_ir: ایندکس جستجوی محصولات

source: Rebuild the FULLTEXT search index for all products.
fa_ir: بازسازی ایندکس جستجو برای تمام محصولات

source: %1$d of %2$d products indexed
fa_ir: تعداد %1$d آیتم از %2$d محصول ایندکس شدند

source: Rebuild Index
fa_ir: بازسازی ایندکس

source: Media Search Index
fa_ir: ایندکس جستجوی رسانه

source: Rebuild the search index for media library items.
fa_ir: بازسازی ایندکس فایلهای بخش رسانه

source: %1$d of %2$d media items indexed
fa_ir: تعداد %1$d آیتم از %2$d فایل آپلود شده ایندکس شدند

source: Cache Management
fa_ir: میدیریت کش

source: Clear all MiniLoad caches including search results and transients.
fa_ir: پاکسازی تمام کش مینی‌لود شامل نتایج جستجو و ترنزینت‌ها

source: %d cached items
fa_ir: %d آیتم کش شده

source: Optimize Database
fa_ir: بهینه‌سازی دیتابیس

source: Optimize MiniLoad database tables for better performance.
fa_ir: بهینه‌سازی جدولهای مربوط به مینی‌لود برای کارایی بیشتر

source: Defragment and optimize tables
fa_ir: بهینه‌سازی و فشرده کردن جدولها

source: Optimize
fa_ir: بهینه‌سازی

source: Import/Export
fa_ir: درون‌ریزی و برون‌ریزی

source: Export Settings
fa_ir: برون‌بری تنظیمات

source: Download all MiniLoad settings as a JSON file.
fa_ir: دانلود تنظیمات مینی‌لود بصورت فایل json

source: Import Settings
fa_ir: درون‌ریزی تنظیمات

source: Import MiniLoad settings from a JSON file.
fa_ir: درون‌ریزی تنظیمات با استفاده از فایل json

source: Diagnostics
fa_ir: اطلاعات

source: Plugin Version
fa_ir: نسخه افزونه

source: WordPress Version
fa_ir: نسخه وردپرس

source: WooCommerce Version
fa_ir: نسخه ووکامرس

source: MySQL Version
fa_ir: نسخه MySQL

source: FULLTEXT Support
fa_ir: پشتیبانی از FULLTEXT

source: Not Supported
fa_ir: عدم پشتیبانی

source: You do not have sufficient permissions to access this page.
fa_ir: عدم دسترسی

source: MiniLoad Dashboard
fa_ir: پیشخوان مینی‌لود

source: MySQL Turbo Mode for WooCommerce - Pure MySQL Performance Optimization
fa_ir: بهینه‌سازی خالص ووکامرس فقط با استفاده از ویژگیهای Mysql و بدون سرویس اضافه!

source: Optimization Score
fa_ir: امتیاز بهینه‌سازی

source: Optimal version
fa_ir: نسخه بهینه

source: Consider upgrading
fa_ir: نیاز به ارتقا

source: HPOS enabled
fa_ir: ویژگی HPOS فعال است

source: Legacy storage
fa_ir: مدل ذخیره‌سازی قدیمی

source: Cache Status
fa_ir: وضعیت کش

source: Indexes Not Built!
fa_ir: ایندکس ساخته نشد!

source: Build indexes to enable MiniLoad optimizations.
fa_ir: ساخت ایندکس‌ها برای فعال سازی بهینه‌سازی‌های مینی‌لود

source: Build Indexes Now
fa_ir: ایندکس کن

source: Rebuild All Indexes
fa_ir: بازسازی تمام ایندکس‌ها

source: Analyze Tables
fa_ir: بررسی جدولها

source: Optimize Tables
fa_ir: بهینه‌سازی جدولها

source: Run Cleanup
fa_ir: تمیزکاری

source: MiniLoad Indexes
fa_ir: ایندکسهای مینی‌لود

source: Index Type
fa_ir: نوع ایندکس

source: Coverage
fa_ir: پوشش

source: Purpose
fa_ir: هدف

source: Status
fa_ir: وضعیت

source: Sort Index
fa_ir: ایندکس مرتب‌سازی محصولات

source: Eliminates postmeta JOINs for sorting
fa_ir: حذف join اضافی مرتب‌سازی محصولات

source: Not Built
fa_ir: ساخته نشده

source: Search Index
fa_ir: ایندکس جستجو

source: FULLTEXT search with SKU instant lookup
fa_ir: ایندکس بهینه‌شده با قابلیت جستجوی سریع شناسه محصول

source: Filter Cache
fa_ir: کش فیلتر

source: Denormalized filter values
fa_ir: بهینه‌سازی فرمت دیتای فیلترها

source: Query Cache
fa_ir: کش کوئری

source: Intelligent caching
fa_ir: کش هوشمند

source: Caches expensive queries
fa_ir: کوئری‌های سنگین را کش میکند

source: Pagination Optimizer
fa_ir: بهینه‌ساز صفحه‌بندی

source: No SQL_CALC_FOUND_ROWS
fa_ir: خبری از کوئری‌های سنگین sql calc found rows نخواهد بود

source: Removes full table scans
fa_ir: از اسکن کل جدول جلوگیری میکند

source: Performance Tips
fa_ir: نکات بهینه‌سازی

source: ✓ Keep all indexes active for optimal performance
fa_ir: ✓ تمام ایندکسها را برای بالارین سطح بهینه‌سازی فعال گه دارید

source: ✓ Run cleanup monthly to maintain database health
fa_ir: ✓ هر ماه عملیات پاکسازی را برای داشتن دیتابیس بهینه‌تر انجام دهید

source: ✓ Enable HPOS in WooCommerce for better scalability
fa_ir: از قابلیت HPOS ووکامرس استفاده کنید

source: ✓ Consider upgrading to MySQL 5.7+ for JSON support
fa_ir: از نسخه‌های بروز Mysql و Mariadb و percona استفاده کید

source: MiniLoad Modules
fa_ir: ماژولهای مینی‌لود

source: All modules work together to deliver maximum WooCommerce performance using pure MySQL optimizations.
fa_ir: تمام ماژول‌ها با استفاده از ویژگیهای Mysql و بدون سرویس اضافه کار می‌مند تا ووکامرس شما کارایی و سرعت بالاتری داشته باشد

source: Eliminates expensive postmeta JOINs for product sorting. Transforms queries from 400-600ms to 2-5ms.
fa_ir: افزایش سرعت پردازش کوئری‌های مرتب‌سازی محصولات با حذف فرایندهای اضافی post meta join

source: Status:
fa_ir: وضعیت:

source: Products Indexed:
fa_ir: محصولات ایندکس شده:

source: Optimizes:
fa_ir: انچه بهینه‌تر خواهد شد؛

source: Search Optimizer
fa_ir: بهینه‌ساز جستجو

source: Lean FULLTEXT search index with instant SKU lookup. 30x smaller index, 10x faster search.
fa_ir: ایندکس کم‌جحم و بهینه FULLTEXT با قابلیت جستجوی آنی شناسه محصول

source: Indexes:
fa_ir: ایندکس‌ها:

source: Intelligent caching of expensive queries with smart invalidation on product changes.
fa_ir: کش هوشمند کوئری‌های سنگین با قابلیت بازسازی در زمان تغییر وضعیت محصولات

source: Cache TTL:
fa_ir: عمر کش:

source: Performance:
fa_ir: کارایی:

source: Removes SQL_CALC_FOUND_ROWS which causes full table scans. Uses fast COUNT queries.
fa_ir: استفاده از کوئری‌های بهینه و سریعتر COUNT بحای هیولای sql calc found rows

source: Improvement:
fa_ir: بهبود:

source: Eliminates:
fa_ir: خذف:

source: Denormalized filter values for instant filter queries. Pre-calculates min/max prices.
fa_ir: بهینه‌سازی فرمت دیتای فیلترها و محاسبه زودهنگام کمترین و بیشترین قیمت

source: Caches:
fa_ir: کش‌ها:

source: Database Indexes
fa_ir: ایندکسهای دیتابیس

source: Strategic MySQL indexes for WooCommerce tables. Covers postmeta, taxonomies, and HPOS.
fa_ir: ایندکسهای کاربردی Mysql شامل postmeta و HOPS و taxonomies

source: Tables Optimized:
fa_ir: حدولهای بهینه‌شده:

source: Impact:
fa_ir: تاثیر

source: Module Performance
fa_ir: کارایی ماژول

source: All modules are currently active and working together to optimize your WooCommerce store:
fa_ir: تمام ماژول‌های برای بهینه‌سازی هر چه بیشتر فروشگاه ووکامرسی شما فعال هستند:

source: ✓ Product sorting: 100x faster (postmeta JOINs eliminated)
fa_ir: ✓ مرتب‌سازی محصولات: تا ۱۰۰ برابر کوئری سریعتر با حذف کوئری‌های اضافه postmeta join

source: ✓ Product search: 50x faster (FULLTEXT index)
fa_ir: ✓ جستجوی محصولات: تا ۵۰ برابر کوئری سریعتر با ایندکس بهینه و مدرن

source: ✓ Pagination: 2-5x faster (no SQL_CALC_FOUND_ROWS)
fa_ir: ✓ صفحه‌بندی: ۲ تا ۵ برابر کوئری سریعتر با بهینه‌سازی یا حذف sql cacl found rows

source: ✓ Filters: 10x faster (denormalized values)
fa_ir: ✓ فیلترها: تا ۱۰ برابر کوئری سریعتر با بهینه‌سازی فرمت دیتای فیلترها

source: ✓ Repeated queries: Instant (intelligent caching)
fa_ir: کوئری‌های تکراری: آنی به کمک کش هوشمند

source: MiniLoad Settings
fa_ir: تنظیمات مینی‌لود

source: Cache TTL
fa_ir: عمر کش

source: Cache time-to-live in seconds (60-3600)
fa_ir: عمر کش به ثانیه (۶۰ تا ۳۶۰۰)

source: Enable debug logging
fa_ir: فعالسازی حالت دیباگ

source: Order Search Max Results
fa_ir: حداکثر نتایج جستجوی سفارشات

source: Maximum number of orders to return in search results (100-999999)
fa_ir: حداکثر آیتم‌های نمایش داده شده در جستجوی سفارشات (بین ۱۰۰ تا ۹۹۹۹۹۹)

source: Set to 999999 for unlimited results. Default: 5000
fa_ir: پیش‌فرض: ۵۰۰۰ محصول. برای بینهایت عدد ۹۹۹۹۹۹ را وارد کنید

source: Note:
fa_ir: نکته:

source: Higher values may impact performance on the orders page.
fa_ir: هر چه مقدار پایینتری وارد کنید کارایی و سرعت بیشتری در صفحه نتایج سفارشات خواهید داشت

source: MiniLoad Tools
fa_ir: ابزارهای مینی‌لود

source: Maintenance and optimization tools for MiniLoad.
fa_ir: ابزارهای بهینه‌سازی مینی‌لود

source: Index
fa_ir: ایندکس

source: Indexed
fa_ir: ایندکس‌شده

source: Total
fa_ir: در محموع

source: Warning: Indexes are incomplete. Rebuild to achieve full optimization.
fa_ir: هشدار: ایندکسها نیاز به بازسازی دارند

source: All indexes are complete
fa_ir: تمام ایندکسها کامل هستند

source: Current cache entries:
fa_ir: تعداد آیتمهای کش‌شده:

source: Clears query cache, filter cache, and transients
fa_ir: پاک کردن کش کوئری‌ها، فیلترها و ترنزینتها

source: Database Optimization
fa_ir: بهینه‌سازی دیتابیس

source: Optimize database tables for better performance.
fa_ir: بهینه‌سازی جدولهای دیتابیس برای کارایی بیشتر

source: Run index rebuild after importing new products
fa_ir: بازسازی ایندکس بعد از ایمپورت کردن محصولات جدید

source: Clear cache after major product updates
fa_ir: پاک کردن کش بعد از بروزرسانی‌های اساسی محصولات

source: Monitor index coverage - aim for 100%
fa_ir: مانیتور کردن پوشش ایندکس‌ها

source: Use the full indexer for complete optimization
fa_ir: ایندکسر کامل برای بهره بردن از تمام بهینه‌سازی‌ها

source: MiniLoad requires PHP version %s or higher.
fa_ir: مینی‌لود به نسخه %s یا بالاتر PHP نیاز دارد

source: MiniLoad requires WordPress version %s or higher.
fa_ir: مینی‌لود به نسخه %s یا بالاتر وردپرس نیاز دارد

source: MiniLoad requires WooCommerce to be installed and activated.
fa_ir: مینی‌لود به فعال بودن ووکامرس نیاز دارد

source: MiniLoad
fa_ir: مینی‌لود

source: Are you sure you want to rebuild indexes? This may take a while.
fa_ir: از ساخت مجدد ایندکسها مطمئن هستید؟

source: Processing...
fa_ir: در حال پردازش...

source: Success!
fa_ir: با موفقیت انجام شد!

source: An error occurred.
fa_ir: خطایی رخ داد!

source: Security check failed
fa_ir: بررسی امنیتی موفقیت آمیز نبود

source: Permission denied
fa_ir: عدم دسترسی

source: Invalid action
fa_ir: عملیات نامعتبر

source: Indexes rebuilt successfully
fa_ir: ایندکسها با موفقیت بازسازی شدند

source: Cache cleared successfully
fa_ir: کش با موفقیت پاک شد

source: Cleanup completed successfully
fa_ir: تمیزکاری با موفقیت انجام شد

source: Open search
fa_ir: باز کردن

source: Search
fa_ir: جستجو

source: Close search
fa_ir: بستن

source: Voice search
fa_ir: جستجوی صوتی

source: All Categories
fa_ir: دسته‌ها

source: Clear search
fa_ir: پاک کردن

source: Popular Searches
fa_ir: کلمات جستجوشده محبوب

source: Searching...
fa_ir: در حال جستجو...

source: No results found
fa_ir: نتیجه‌ای یافت نشد

source: View all results
fa_ir: نمایش تمام نتایج
