Repository: mohsengham/miniload
Catalog: languages/miniload-*.po
Languages: fa_ir

source: Search everything... (products, orders, users)
fa_ir: جستجوی محصولات، سفارشات و کاربران

source: Press Alt+K to search
fa_ir: باز شدن سرچ باکس مدیریت با کلیدهای Alt+k

source: Filter cache rebuilt successfully
fa_ir: کش فبلترها با موقیت ساخته شد

source: Media
fa_ir: رسانه

source: Indexed %1$d media items in %2$s seconds
fa_ir: تمام %1$d رسانه موجود در %2$s ثانیه ایندکس شدند

source: Order search index rebuilt successfully
fa_ir: ایندکس سفارشات با موقیت ساخته شد

source: SQL_CALC_FOUND_ROWS removed by MiniLoad
fa_ir: حذف کوئری SQL_CALC_FOUND_ROWS توسط مینی‌لود

source: Clear MiniLoad Cache
fa_ir: پاک کردن کش مینی‌لود

source: Clear all MiniLoad query caches
fa_ir: پاک کردن کش تمام کوئری‌های مربوط به مینی‌لود

source: Indexed %1$d products successfully, %2$d failed. Time: %3$s seconds
fa_ir: محصولات ایندکس شده: %1$d مورد. موارد ناموفق: %2$d محصول. زمان انجام فرایند: %3$s ثانیه

source: Search index rebuilt successfully
fa_ir: ایندکس جستجوی محصولات با موفقیت ساخته شد

source: Sort index rebuilt successfully
fa_ir: ایندکس مرتب‌سازی محصولات با موقیت ساخته شد

source: Indexed:
fa_ir: ایندکس شده:

source: Failed:
fa_ir: ناموفق:

source: Indexed Orders
fa_ir: سفارشات ایندکس شده

source: Total Orders
fa_ir: کل سفارشات

source: Features
fa_ir: ویژگی‌ها

source: Auto-indexing
fa_ir: ایندکس خودکار

source: SKU:
fa_ir: شناسه:

source: Did you mean?
fa_ir: منظورتان این بود؟

source: Save Limit
fa_ir: ذخیره

source: Saving...
fa_ir: در حال ذخیره کردن...

source: Saved!
fa_ir: ذخیره شد!

source: orders
fa_ir: سفارشات

source: Error!
fa_ir: خطا!

source: Status & Information
fa_ir: وضعیت و اطلاعات

source: View cache statistics:
fa_ir: مشاهده امار کش:

source: Rebuild all indexes:
fa_ir: بازسازی تمام ایندکس‌ها:

source: Advanced Options
fa_ir: گزینه‌های پیشرفته

source: Clear index before rebuilding:
fa_ir: پاک کردن ایندکس قبل از پاکسازی

source: Show progress bar:
fa_ir: نمایش نوار پیشرفت:

source: Clear all MiniLoad caches:
fa_ir: پاک کردن کش مینی‌لود

source: Every 30 Minutes
fa_ir: هر ۳۰ دقیقه
